joristork/robots/jobot_in_c/microchip_extras/h/p18f66j90.h
extern volatile near unsigned char       LCDDATA7;
extern volatile near union {
  struct {
    unsigned LCDDATA7:8;
  };
  struct {
    unsigned S8C1:1;
    unsigned S9C1:1;
    unsigned S10C1:1;
    unsigned S11C1:1;
    unsigned S12C1:1;
    unsigned S13C1:1;
    unsigned S14C1:1;
    unsigned S15C1:1;
  };
  struct {
    unsigned SEG8COM1:1;
    unsigned SEG9COM1:1;
    unsigned SEG10COM1:1;
    unsigned SEG11COM1:1;
    unsigned SEG12COM1:1;
    unsigned SEG13COM1:1;
    unsigned SEG14COM1:1;
    unsigned SEG15COM1:1;
  };
  struct {
    unsigned S08C1:1;
    unsigned S09C1:1;
  };
} LCDDATA7bits;
extern volatile near unsigned char       LCDDATA8;
extern volatile near union {
  struct {
    unsigned LCDDATA8:8;
  };
  struct {
    unsigned S16C1:1;
    unsigned S17C1:1;
    unsigned S18C1:1;
    unsigned S19C1:1;
    unsigned S20C1:1;
    unsigned S21C1:1;
    unsigned S22C1:1;
    unsigned S23C1:1;
  };
  struct {
    unsigned SEG16COM1:1;
    unsigned SEG17COM1:1;
    unsigned SEG18COM1:1;
    unsigned SEG19COM1:1;
    unsigned SEG20COM1:1;
    unsigned SEG21COM1:1;
    unsigned SEG22COM1:1;
    unsigned SEG23COM1:1;
  };
} LCDDATA8bits;
extern volatile near unsigned char       LCDDATA9;
extern volatile near union {
  struct {
    unsigned LCDDATA9:8;
  };
  struct {
    unsigned S24C1:1;
    unsigned S25C1:1;
    unsigned S26C1:1;
    unsigned S27C1:1;
    unsigned S28C1:1;
    unsigned S29C1:1;
    unsigned S30C1:1;
    unsigned S31C1:1;
  };
  struct {
    unsigned SEG24COM1:1;
    unsigned SEG25COM1:1;
    unsigned SEG26COM1:1;
    unsigned SEG27COM1:1;
    unsigned SEG28COM1:1;
    unsigned SEG29COM1:1;
    unsigned SEG30COM1:1;
    unsigned SEG31COM1:1;
  };
} LCDDATA9bits;
extern volatile near unsigned char       LCDDATA10;
extern volatile near union {
  struct {
    unsigned S32C1:1;
  };
  struct {
    unsigned SEG32COM1:1;
  };
} LCDDATA10bits;
extern volatile near unsigned char       LCDDATA12;
extern volatile near union {
  struct {
    unsigned LCDDATA12:8;
  };
  struct {
    unsigned S00C2:1;
    unsigned S01C2:1;
    unsigned S02C2:1;
    unsigned S03C2:1;
    unsigned S04C2:1;
    unsigned S05C2:1;
    unsigned S06C2:1;
    unsigned S07C2:1;
  };
  struct {
    unsigned SEG0COM2:1;
    unsigned SEG1COM2:1;
    unsigned SEG2COM2:1;
    unsigned SEG3COM2:1;
    unsigned SEG4COM2:1;
    unsigned SEG5COM2:1;
    unsigned SEG6COM2:1;
    unsigned SEG7COM2:1;
  };
  struct {
    unsigned S0C2:1;
    unsigned S1C2:1;
    unsigned S2C2:1;
    unsigned S3C2:1;
    unsigned S4C2:1;
    unsigned S5C2:1;
    unsigned S6C2:1;
    unsigned S7C2:1;
  };
} LCDDATA12bits;
extern volatile near unsigned char       LCDDATA13;
extern volatile near union {
  struct {
    unsigned LCDDATA13:8;
  };
  struct {
    unsigned S8C2:1;
    unsigned S9C2:1;
    unsigned S10C2:1;
    unsigned S11C2:1;
    unsigned S12C2:1;
    unsigned S13C2:1;
    unsigned S14C2:1;
    unsigned S15C2:1;
  };
  struct {
    unsigned SEG8COM2:1;
    unsigned SEG9COM2:1;
    unsigned SEG10COM2:1;
    unsigned SEG11COM2:1;
    unsigned SEG12COM2:1;
    unsigned SEG13COM2:1;
    unsigned SEG14COM2:1;
    unsigned SEG15COM2:1;
  };
  struct {
    unsigned S08C2:1;
    unsigned S09C2:1;
  };
} LCDDATA13bits;
extern volatile near unsigned char       LCDDATA14;
extern volatile near union {
  struct {
    unsigned LCDDATA14:8;
  };
  struct {
    unsigned S16C2:1;
    unsigned S17C2:1;
    unsigned S18C2:1;
    unsigned S19C2:1;
    unsigned S20C2:1;
    unsigned S21C2:1;
    unsigned S22C2:1;
    unsigned S23C2:1;
  };
  struct {
    unsigned SEG16COM2:1;
    unsigned SEG17COM2:1;
    unsigned SEG18COM2:1;
    unsigned SEG19COM2:1;
    unsigned SEG20COM2:1;
    unsigned SEG21COM2:1;
    unsigned SEG22COM2:1;
    unsigned SEG23COM2:1;
  };
} LCDDATA14bits;
extern volatile near unsigned char       LCDDATA15;
extern volatile near union {
  struct {
    unsigned LCDDATA15:8;
  };
  struct {
    unsigned S24C2:1;
    unsigned S25C2:1;
    unsigned S26C2:1;
    unsigned S27C2:1;
    unsigned S28C2:1;
    unsigned S29C2:1;
    unsigned S30C2:1;
    unsigned S31C2:1;
  };
  struct {
    unsigned SEG24COM2:1;
    unsigned SEG25COM2:1;
    unsigned SEG26COM2:1;
    unsigned SEG27COM2:1;
    unsigned SEG28COM2:1;
    unsigned SEG29COM2:1;
    unsigned SEG30COM2:1;
    unsigned SEG31COM2:1;
  };
} LCDDATA15bits;
extern volatile near unsigned char       LCDDATA16;
extern volatile near union {
  struct {
    unsigned S32C2:1;
  };
  struct {
    unsigned SEG32COM2:1;
  };
} LCDDATA16bits;
extern volatile near unsigned char       LCDDATA18;
extern volatile near union {
  struct {
    unsigned LCDDATA18:8;
  };
  struct {
    unsigned S00C3:1;
    unsigned S01C3:1;
    unsigned S02C3:1;
    unsigned S03C3:1;
    unsigned S04C3:1;
    unsigned S05C3:1;
    unsigned S06C3:1;
    unsigned S07C3:1;
  };
  struct {
    unsigned SEG00COM3:1;
    unsigned SEG01COM3:1;
    unsigned SEG02COM3:1;
    unsigned SEG03COM3:1;
    unsigned SEG04COM3:1;
    unsigned SEG05COM3:1;
    unsigned SEG06COM3:1;
    unsigned SEG07COM3:1;
  };
  struct {
    unsigned S0C3:1;
    unsigned S1C3:1;
    unsigned S2C3:1;
    unsigned S3C3:1;
    unsigned S4C3:1;
    unsigned S5C3:1;
    unsigned S6C3:1;
    unsigned S7C3:1;
  };
} LCDDATA18bits;
extern volatile near unsigned char       LCDDATA19;
extern volatile near union {
  struct {
    unsigned LCDDATA19:8;
  };
  struct {
    unsigned S8C3:1;
    unsigned S9C3:1;
    unsigned S10C3:1;
    unsigned S11C3:1;
    unsigned S12C3:1;
    unsigned S13C3:1;
    unsigned S14C3:1;
    unsigned S15C3:1;
  };
  struct {
    unsigned SEG8COM3:1;
    unsigned SEG9COM3:1;
    unsigned SEG10COM3:1;
    unsigned SEG11COM3:1;
    unsigned SEG12COM3:1;
    unsigned SEG13COM3:1;
    unsigned SEG14COM3:1;
    unsigned SEG15COM3:1;
  };
  struct {
    unsigned S08C3:1;
    unsigned S09C3:1;
  };
} LCDDATA19bits;
