joristork/robots/jobot_in_c/microchip_extras/h/p18f66j90.h
extern volatile near unsigned char       LCDSE4;
extern volatile near union {
  struct {
    unsigned LCDSE4:8;
  };
  struct {
    unsigned SE32:1;
  };
  struct {
    unsigned SEGEN32:1;
  };
} LCDSE4bits;
extern volatile near unsigned char       LCDDATA0;
extern volatile near union {
  struct {
    unsigned LCDDATA0:8;
  };
  struct {
    unsigned S0C0:1;
    unsigned S1C0:1;
    unsigned S2C0:1;
    unsigned S3C0:1;
    unsigned S4C0:1;
    unsigned S5C0:1;
    unsigned S6C0:1;
    unsigned S7C0:1;
  };
  struct {
    unsigned SEG0COM0:1;
    unsigned SEG1COM0:1;
    unsigned SEG2COM0:1;
    unsigned SEG3COM0:1;
    unsigned SEG4COM0:1;
    unsigned SEG5COM0:1;
    unsigned SEG6COM0:1;
    unsigned SEG7COM0:1;
  };
  struct {
    unsigned S00C0:1;
    unsigned S01C0:1;
    unsigned S02C0:1;
    unsigned S03C0:1;
    unsigned S04C0:1;
    unsigned S05C0:1;
    unsigned S06C0:1;
    unsigned S07C0:1;
  };
} LCDDATA0bits;
extern volatile near unsigned char       LCDDATA1;
extern volatile near union {
  struct {
    unsigned LCDDATA1:8;
  };
  struct {
    unsigned S8C0:1;
    unsigned S9C0:1;
    unsigned S10C0:1;
    unsigned S11C0:1;
    unsigned S12C0:1;
    unsigned S13C0:1;
    unsigned S14C0:1;
    unsigned S15C0:1;
  };
  struct {
    unsigned SEG8COM0:1;
    unsigned SEG9COM0:1;
    unsigned SEG10COM0:1;
    unsigned SEG11COM0:1;
    unsigned SEG12COM0:1;
    unsigned SEG13COM0:1;
    unsigned SEG14COM0:1;
    unsigned SEG15COM0:1;
  };
  struct {
    unsigned S08C0:1;
    unsigned S09C0:1;
  };
} LCDDATA1bits;
extern volatile near unsigned char       LCDDATA2;
extern volatile near union {
  struct {
    unsigned LCDDATA2:8;
  };
  struct {
    unsigned S16C0:1;
    unsigned S17C0:1;
    unsigned S18C0:1;
    unsigned S19C0:1;
    unsigned S20C0:1;
    unsigned S21C0:1;
    unsigned S22C0:1;
    unsigned S23C0:1;
  };
  struct {
    unsigned SEG16COM0:1;
    unsigned SEG17COM0:1;
    unsigned SEG18COM0:1;
    unsigned SEG19COM0:1;
    unsigned SEG20COM0:1;
    unsigned SEG21COM0:1;
    unsigned SEG22COM0:1;
    unsigned SEG23COM0:1;
  };
} LCDDATA2bits;
extern volatile near unsigned char       LCDDATA3;
extern volatile near union {
  struct {
    unsigned LCDDATA3:8;
  };
  struct {
    unsigned S24C0:1;
    unsigned S25C0:1;
    unsigned S26C0:1;
    unsigned S27C0:1;
    unsigned S28C0:1;
    unsigned S29C0:1;
    unsigned S30C0:1;
    unsigned S31C0:1;
  };
  struct {
    unsigned SEG24COM0:1;
    unsigned SEG25COM0:1;
    unsigned SEG26COM0:1;
    unsigned SEG27COM0:1;
    unsigned SEG28COM0:1;
    unsigned SEG29COM0:1;
    unsigned SEG30COM0:1;
    unsigned SEG31COM0:1;
  };
} LCDDATA3bits;
extern volatile near unsigned char       LCDDATA4;
extern volatile near union {
  struct {
    unsigned LCDDATA4:8;
  };
  struct {
    unsigned S32C0:1;
    unsigned S33C0:1;
    unsigned S34C0:1;
    unsigned S35C0:1;
    unsigned S36C0:1;
    unsigned S37C0:1;
    unsigned S38C0:1;
    unsigned S39C0:1;
  };
  struct {
    unsigned SEG32COM0:1;
    unsigned SEG33COM0:1;
    unsigned SEG34COM0:1;
    unsigned SEG35COM0:1;
    unsigned SEG36COM0:1;
    unsigned SEG37COM0:1;
    unsigned SEG38COM0:1;
    unsigned SEG39COM0:1;
  };
} LCDDATA4bits;
extern volatile near unsigned char       ADCON2;
extern volatile near union {
  struct {
    unsigned ADCS:3;
    unsigned ACQT:3;
    unsigned :1;
    unsigned ADFM:1;
  };
  struct {
    unsigned ADCS0:1;
    unsigned ADCS1:1;
    unsigned ADCS2:1;
    unsigned ACQT0:1;
    unsigned ACQT1:1;
    unsigned ACQT2:1;
  };
} ADCON2bits;
extern volatile near unsigned char       ADCON1;
extern volatile near union {
  struct {
    unsigned PCFG:4;
    unsigned VCFG:2;
    unsigned :1;
    unsigned TRIGSEL:1;
  };
  struct {
    unsigned PCFG0:1;
    unsigned PCFG1:1;
    unsigned PCFG2:1;
    unsigned PCFG3:1;
    unsigned VCFG0:1;
    unsigned VCFG1:1;
  };
} ADCON1bits;
extern volatile near unsigned char       ADCON0;
extern volatile near union {
  struct {
    unsigned ADON:1;
    unsigned GO_NOT_DONE:1;
    unsigned CHS:4;
    unsigned :1;
    unsigned ADCAL:1;
  };
  struct {
    unsigned :1;
    unsigned GO_DONE:1;
    unsigned CHS0:1;
    unsigned CHS1:1;
    unsigned CHS2:1;
    unsigned CHS3:1;
  };
  struct {
    unsigned :1;
    unsigned DONE:1;
  };
  struct {
    unsigned :1;
    unsigned GO:1;
  };
  struct {
    unsigned :1;
    unsigned NOT_DONE:1;
  };
} ADCON0bits;
extern volatile near unsigned            ADRES;
extern volatile near unsigned char       ADRESL;
extern volatile near unsigned char       ADRESH;
extern volatile near unsigned char       SSP1CON2;
extern volatile near union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned ACKSTAT:1;
    unsigned GCEN:1;
  };
  struct {
    unsigned :1;
    unsigned ADMSK1:1;
    unsigned ADMSK2:1;
    unsigned ADMSK3:1;
    unsigned ADMSK4:1;
    unsigned ADMSK5:1;
  };
} SSP1CON2bits;
extern volatile near unsigned char       SSPCON2;
extern volatile near union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned ACKSTAT:1;
    unsigned GCEN:1;
  };
  struct {
    unsigned :1;
    unsigned ADMSK1:1;
    unsigned ADMSK2:1;
    unsigned ADMSK3:1;
    unsigned ADMSK4:1;
    unsigned ADMSK5:1;
  };
} SSPCON2bits;
extern volatile near unsigned char       SSP1CON1;
extern volatile near union {
  struct {
    unsigned SSPM:4;
    unsigned CKP:1;
    unsigned SSPEN:1;
    unsigned SSPOV:1;
    unsigned WCOL:1;
  };
  struct {
    unsigned SSPM0:1;
    unsigned SSPM1:1;
    unsigned SSPM2:1;
    unsigned SSPM3:1;
  };
} SSP1CON1bits;
extern volatile near unsigned char       SSPCON1;
extern volatile near union {
  struct {
    unsigned SSPM:4;
    unsigned CKP:1;
    unsigned SSPEN:1;
    unsigned SSPOV:1;
    unsigned WCOL:1;
  };
  struct {
    unsigned SSPM0:1;
    unsigned SSPM1:1;
    unsigned SSPM2:1;
    unsigned SSPM3:1;
  };
} SSPCON1bits;
extern volatile near unsigned char       SSP1STAT;
extern volatile near union {
  struct {
    unsigned BF:1;
    unsigned UA:1;
    unsigned R_NOT_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_NOT_A:1;
    unsigned CKE:1;
    unsigned SMP:1;
  };
  struct {
    unsigned :2;
    unsigned R:1;
    unsigned :2;
    unsigned D:1;
  };
  struct {
    unsigned :2;
    unsigned R_W:1;
    unsigned :2;
    unsigned D_A:1;
  };
  struct {
    unsigned :2;
    unsigned NOT_W:1;
    unsigned :2;
    unsigned NOT_A:1;
  };
  struct {
    unsigned :2;
    unsigned NOT_WRITE:1;
    unsigned :2;
    unsigned NOT_ADDRESS:1;
  };
  struct {
    unsigned :2;
    unsigned READ_WRITE:1;
    unsigned :2;
    unsigned DATA_ADDRESS:1;
  };
  struct {
    unsigned :2;
    unsigned I2C_READ:1;
    unsigned I2C_START:1;
    unsigned I2C_STOP:1;
    unsigned I2C_DAT:1;
  };
} SSP1STATbits;
extern volatile near unsigned char       SSPSTAT;
extern volatile near union {
  struct {
    unsigned BF:1;
    unsigned UA:1;
    unsigned R_NOT_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_NOT_A:1;
    unsigned CKE:1;
    unsigned SMP:1;
  };
  struct {
    unsigned :2;
    unsigned R:1;
    unsigned :2;
    unsigned D:1;
  };
  struct {
    unsigned :2;
    unsigned R_W:1;
    unsigned :2;
    unsigned D_A:1;
  };
  struct {
    unsigned :2;
    unsigned NOT_W:1;
    unsigned :2;
    unsigned NOT_A:1;
  };
  struct {
    unsigned :2;
    unsigned NOT_WRITE:1;
    unsigned :2;
    unsigned NOT_ADDRESS:1;
  };
  struct {
    unsigned :2;
    unsigned READ_WRITE:1;
    unsigned :2;
    unsigned DATA_ADDRESS:1;
  };
  struct {
    unsigned :2;
    unsigned I2C_READ:1;
    unsigned I2C_START:1;
    unsigned I2C_STOP:1;
    unsigned I2C_DAT:1;
  };
} SSPSTATbits;
extern volatile near unsigned char       SSP1ADD;
extern volatile near union {
  struct {
    unsigned SSPADD:8;
  };
  struct {
    unsigned MSK0:1;
    unsigned MSK1:1;
    unsigned MSK2:1;
    unsigned MSK3:1;
    unsigned MSK4:1;
    unsigned MSK5:1;
    unsigned MSK6:1;
    unsigned MSK7:1;
  };
} SSP1ADDbits;
extern volatile near unsigned char       SSPADD;
extern volatile near union {
  struct {
    unsigned SSPADD:8;
  };
  struct {
    unsigned MSK0:1;
    unsigned MSK1:1;
    unsigned MSK2:1;
    unsigned MSK3:1;
    unsigned MSK4:1;
    unsigned MSK5:1;
    unsigned MSK6:1;
    unsigned MSK7:1;
  };
} SSPADDbits;
